Revit 2024 API
GlobalParameter.GetValue Method
 Obtains the curent value of the global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public ParameterValue GetValue()
Visual Basic
Public Function GetValue As ParameterValue
Visual C++
public:
ParameterValue^ GetValue()
Return Value
 An instance of one of the classes derived from the ParameterValue base class.
Remarks
Note that a value is always returned regardless of whether the parameter is formula-driven, or dimension-driven, or independent.
The returned ParameterValue is casted-up an instance of one of the derived classes, such as DoubleParameterValue or IntegerParameterValue.
See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace